Ran Plan for dir: `terraform/example` workspace: `default`

<details><summary>Show Output</summary>

```diff
aws_s3_bucket.test_bucket: Refreshing state... [id=atlantis-test-20220722044034658300000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_dynamodb_table.terraform_locks will be created
+ resource "aws_dynamodb_table" "terraform_locks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "User"
      + id               = (known after apply)
      + name             = "Backend"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "User"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = (known after apply)
          + enabled        = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with aws_s3_bucket.test_bucket,
│   on s3.tf line 1, in resource "aws_s3_bucket" "test_bucket":
│    1: resource "aws_s3_bucket" "test_bucket" {
│ 
│ Use the aws_s3_bucket_versioning resource instead
│ 
│ (and 3 more similar warnings elsewhere)
╵

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/example`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-atlantis-atlantis-49509e0cf3-1238793355.us-west-2.elb.amazonaws.com/lock?id=infra-pipeline-hackathon22%252Fhackathon-atlantis%252Fterraform%252Fexample%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/example`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
